backend/study_group_concurrency_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">8082</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">X-User</stringProp>
            <stringProp name="Header.value">alice</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">X-Role</stringProp>
            <stringProp name="Header.value">ADMIN</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrent Create Test">
        <intProp name="ThreadGroup.num_threads">4</intProp>
        <intProp name="ThreadGroup.ramp_time">0</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Concurrent Create - Unique Data">
          <stringProp name="HTTPSampler.path">/api/groups</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;name&quot;: &quot;КонкурентнаяГруппа${__Random(1,10000)}&quot;,&#xd;
  &quot;coordinates&quot;: { &#xd;
    &quot;x&quot;: ${__Random(100,300)}, &#xd;
    &quot;y&quot;: ${__Random(100,300)} 	&#xd;
  },&#xd;
  &quot;studentsCount&quot;: 25,&#xd;
  &quot;expelledStudents&quot;: 1,&#xd;
  &quot;transferredStudents&quot;: 1,&#xd;
  &quot;formOfEducation&quot;: &quot;DISTANCE_EDUCATION&quot;, &#xd;
  &quot;shouldBeExpelled&quot;: 1,&#xd;
  &quot;averageMark&quot;: 3.7,&#xd;
  &quot;semesterEnum&quot;: &quot;SECOND&quot;,&#xd;
  &quot;groupAdmin&quot;: {&#xd;
    &quot;name&quot;: &quot;Тестовый Админ${__Random(1,10000)}&quot;,&#xd;
    &quot;eyeColor&quot;: &quot;BLACK&quot;,&#xd;
    &quot;hairColor&quot;: &quot;BLACK&quot;,&#xd;
    &quot;location&quot;: { &#xd;
      &quot;x&quot;: ${__Random(1,100)}, &#xd;
      &quot;y&quot;: ${__Random(1,100)}, &#xd;
      &quot;z&quot;: 0.0 &#xd;
    },&#xd;
    &quot;passportID&quot;: &quot;CONCURRENT${__Random(1,10000)}&quot;,&#xd;
    &quot;nationality&quot;: &quot;FRANCE&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Concurrent Create - Duplicate Data">
          <stringProp name="HTTPSampler.path">/api/groups</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;name&quot;: &quot;DuplicateGroupTest&quot;,&#xd;
  &quot;coordinates&quot;: { &quot;x&quot;: 11, &quot;y&quot;: 11 },&#xd;
  &quot;studentsCount&quot;: 25,&#xd;
  &quot;expelledStudents&quot;: 1,&#xd;
  &quot;transferredStudents&quot;: 1,&#xd;
  &quot;formOfEducation&quot;: &quot;DISTANCE_EDUCATION&quot;,&#xd;
  &quot;shouldBeExpelled&quot;: 1,&#xd;
  &quot;averageMark&quot;: 4.0,&#xd;
  &quot;semesterEnum&quot;: &quot;SECOND&quot;,&#xd;
  &quot;groupAdmin&quot;: {&#xd;
    &quot;name&quot;: &quot;Duplicate Admin&quot;,&#xd;
    &quot;eyeColor&quot;: &quot;BLACK&quot;,&#xd;
    &quot;hairColor&quot;: &quot;BLACK&quot;,&#xd;
    &quot;location&quot;: { &quot;x&quot;: 99.0, &quot;y&quot;: 99, &quot;z&quot;: 0.0 },&#xd;
    &quot;passportID&quot;: &quot;DUPLICATE_PASSPORT&quot;,&#xd;
    &quot;nationality&quot;: &quot;FRANCE&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer" enabled="true">
          <intProp name="groupSize">5</intProp>
          <longProp name="timeoutInMs">0</longProp>
        </SyncTimer>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Setup - Create Group for Update Test">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.path">/api/groups</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;name&quot;: &quot;Группа говна&quot;,&#xd;
  &quot;coordinates&quot;: { &#xd;
    &quot;x&quot;: ${__Random(100,300)}, &#xd;
    &quot;y&quot;: ${__Random(100,300)} 	&#xd;
  },&#xd;
  &quot;studentsCount&quot;: 25,&#xd;
  &quot;expelledStudents&quot;: 1,&#xd;
  &quot;transferredStudents&quot;: 1,&#xd;
  &quot;formOfEducation&quot;: &quot;DISTANCE_EDUCATION&quot;, &#xd;
  &quot;shouldBeExpelled&quot;: 1,&#xd;
  &quot;averageMark&quot;: 3.7,&#xd;
  &quot;semesterEnum&quot;: &quot;SECOND&quot;,&#xd;
  &quot;groupAdmin&quot;: {&#xd;
    &quot;name&quot;: &quot;Тестовый Админ${__Random(1,10000)}&quot;,&#xd;
    &quot;eyeColor&quot;: &quot;BLACK&quot;,&#xd;
    &quot;hairColor&quot;: &quot;BLACK&quot;,&#xd;
    &quot;location&quot;: { &#xd;
      &quot;x&quot;: ${__Random(1,100)}, &#xd;
      &quot;y&quot;: ${__Random(1,100)}, &#xd;
      &quot;z&quot;: 0.0 &#xd;
    },&#xd;
    &quot;passportID&quot;: &quot;CONCURRENT${__Random(1,10000)}&quot;,&#xd;
    &quot;nationality&quot;: &quot;FRANCE&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor">
          <stringProp name="JSONPostProcessor.referenceNames">groupId</stringProp>
          <stringProp name="JSONPostProcessor.jsonPathExprs">$.id</stringProp>
          <stringProp name="Sample.scope">variable</stringProp>
          <stringProp name="Scope.variable">groupId</stringProp>
        </JSONPostProcessor>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrent Update Test">
        <intProp name="ThreadGroup.num_threads">3</intProp>
        <intProp name="ThreadGroup.ramp_time">0</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.path">/api/groups/${__P(groupId)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&#xd;
  {&#xd;
    &quot;name&quot;: &quot;Уже хорошая группа&quot;,&#xd;
    &quot;coordinates&quot;: { &quot;x&quot;: 22, &quot;y&quot;: 11 },&#xd;
    &quot;studentsCount&quot;: 2,&#xd;
    &quot;expelledStudents&quot;: 2,&#xd;
    &quot;transferredStudents&quot;: 1,&#xd;
    &quot;formOfEducation&quot;: &quot;DISTANCE_EDUCATION&quot;,&#xd;
    &quot;shouldBeExpelled&quot;: 1,&#xd;
    &quot;averageMark&quot;: 3.7,&#xd;
    &quot;semesterEnum&quot;: &quot;SECOND&quot;,&#xd;
    &quot;groupAdmin&quot;: {&#xd;
      &quot;name&quot;: &quot;ANDREY LASHKUL&quot;,&#xd;
      &quot;eyeColor&quot;: &quot;BLACK&quot;,&#xd;
      &quot;hairColor&quot;: &quot;BLACK&quot;,&#xd;
      &quot;location&quot;: { &quot;x&quot;: 1.0, &quot;y&quot;: 100, &quot;z&quot;: 0.0 },&#xd;
      &quot;passportID&quot;: &quot;ABCD1234&quot;,&#xd;
      &quot;nationality&quot;: &quot;FRANCE&quot;&#xd;
    }&#xd;
  }&#xd;
&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrent Import Test">
        <intProp name="ThreadGroup.num_threads">3</intProp>
        <intProp name="ThreadGroup.ramp_time">0</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <stringProp name="HTTPSampler.path">/api/groups/import</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">true</boolProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
            <collectionProp name="HTTPFileArgs.files">
              <elementProp name="groups.json" elementType="HTTPFileArg">
                <stringProp name="File.mimetype">application/json</stringProp>
                <stringProp name="File.path">groups.json</stringProp>
                <stringProp name="File.paramname">file</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>